import {app} from './app/app';

import './index.scss';

console.log('Стартовая страница и навигация +20\n Настройки +40\nСтраница категорий +30\nСтраница с вопросами +50\nСтраница с результатами +50')
console.log('Результаты раунда можно посмотреть нажав на уже проигрывавшийся раунд или на странице Score\nScore открывается с первой категории данного типа вопросов\nЕще не проигранные раунды скрыты от пользователя');
console.log('Плавная смена изображений 0');
console.log('Реализована анимация отдельных деталей интерфейса, также анимированы переходы и взаимодействия, чтобы работа с приложением шла плавным и непрерывным потоком +20');
console.log('Анимация появления навигации в футере, анимация появления настроек, модальных окон в течение раунда и по его завершению, модальные окна в секции Score');
console.log('Дополнительный функционал: разные типы уведомлений по окончании раунда в зависимости от результата');


app();


